// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   ModeStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell mode command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_MODE_STAND_OUTPUT          #language eng  "Available modes on standard output\n"

#string STR_MODE_CANNOT_QUERY          #language eng  "%Hmode%N: Cannot query mode - %r\n"

#string STR_MODE_COL_ROW               #language eng  "  col %3d row %3d  %c\n"

#string STR_MODE_MODE_NOT_FOUND        #language eng  "%Hmode%N: Mode (%d,%d) not found\n"

#string STR_MODE_LINE_HELP             #language eng  "Displays or changes the mode of the console output device"

#string STR_MODE_VERBOSE_HELP          #language eng  "Displays or changes the mode of the console output device.\n" 
                                                      "\n"
                                                      "MODE [row col]\n"
                                                      "\n"
                                                      "    row     - Row number of the mode\n"
                                                      "    col     - Column number of the mode\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "    1. The mode with a star at line end is the current mode setting.\n"
                                                      "    2. When console redirection is turned on, only 80x25 mode is supported in\n"
                                                      "       current sample implementation.\n"
                                                      "    3. Most EFI command output was designed with 80x50 mode in mind (50 rows).\n"
                                                      "\n"
                                                      "Examples:\n"
                                                      "  * To display available mode on standard output:\n"
                                                      "    Shell> mode\n"
                                                      "    Available modes on standard output\n"
                                                      "      col  80 row  25  *\n"
                                                      "      col  80 row  50\n"
                                                      "      col  80 row  43\n"
                                                      "      col 100 row 100\n"
                                                      "      col 100 row 999\n"
                                                      "\n"
                                                      "  * To change the current mode setting:\n"
                                                      "    Shell> mode 80 50\n"
                                                      "    Available modes on standard output\n"
                                                      "      col  80 row  25\n"
                                                      "      col  80 row  50  *\n"
                                                      "      col  80 row  43\n"
                                                      "      col 100 row 100\n"
                                                      "      col 100 row 999\n"


